NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
/**
 ****************************************************************************************
 *
 * @file ESP32_PAC195X.c
 *
 * @brief  This is a standard library from microchip for PAC194x/5x family customized to work with ESP32 and ESP32s2.
 *
 * @Author Akshay Das
 * 
 * Copyright (C) 2022-23 Nyquest Innovations Labs.
 * 
 * @Date July 2022
 ****************************************************************************************
 **/
 
// PAC194x/5x MCC library version
// #define PAC194X5X_LIBVER "1.0"

#include "esp32s2_pac1952.h"
#include "esp32s2_i2c_protocol.h"
#include "esp_log.h"

#define TAG "inside pac1952"

// PAC194x/5x device#1 context data
PAC194X5X_DEVICE_CONTEXT PACdevice;
PPAC194X5X_DEVICE_CONTEXT pPACdevice = &PACdevice;

void init_pac1952(void){
    PAC194X5X_i2cParams i2cParams = {   PAC194X5X_CLIENT_ADDRESS_1, 
                                        PAC194X5X_BUS_ID_1 };

    uint32_t rsense[PAC194X5X_MAX_CH_COUNT] = { RSENSE_MICRO_CH1, 
                                                RSENSE_MICRO_CH2, 
                                                RSENSE_MICRO_CH3, 
                                                RSENSE_MICRO_CH4 };

    float VrailToVbusRatio[PAC194X5X_MAX_CH_COUNT] = {  VRAIL_VBUS_RATIO_CH1,
                                                        VRAIL_VBUS_RATIO_CH2,
                                                        VRAIL_VBUS_RATIO_CH3,
                                                        VRAIL_VBUS_RATIO_CH4 };

   uint16_t errorCode = PAC194X5X_SUCCESS;
   errorCode = PAC194x5x_Device_Initialize(i2cParams, pPACdevice, VrailToVbusRatio, rsense);
   if(errorCode != PAC194X5X_SUCCESS){
        ESP_LOGI(TAG,"Couldn't initialize PAC1952");
   }
}

float getBatteryVoltage(){
    uint16_t Vbus_ch1;
    PAC194x5x_GetVBUSn_reg(pPACdevice, 1, &Vbus_ch1);
    return (float) ((Vbus_ch1/65536)*32.0);
}

uint8_t getOverVoltageStatus(){
    uint16_t errorCode = PAC194X5X_SUCCESS;
    PAC194X5X_ALERT_STATUS_REGISTER AlertStatus_reg;
    vTaskDelay(10/portTICK_RATE_MS);
    errorCode = PAC194x5x_GetAlertStatus_reg(pPACdevice, &AlertStatus_reg);
    if(errorCode != PAC194X5X_SUCCESS) {
        ESP_LOGI(TAG,"%s , error code : %s",__func__,esp_err_to_name(errorCode));
    }
    return (uint8_t) AlertStatus_reg.CH1_OV;
}

// RECOMMENDATION //
// Allow 1ms between PAC194x5x_Device_Initialize() and the next device operation.
uint16_t PAC194x5x_Device_Initialize(PAC194X5X_i2cParams i2cParams, PPAC194X5X_DEVICE_CONTEXT pdevice, float *VrailToVbusRatio, uint32_t *prsense){

    uint16_t errorCode = PAC194X5X_SUCCESS;
    int i;
    
    // Section 1 - initialization of the device context variables and parameters
    
    // set the i2c parameters
    pdevice->i2cAddress = i2cParams.i2cAddress;
    pdevice->i2cBusID = i2cParams.i2cBusID;
    pdevice->ENABLE_BYTE_COUNT_FLAG = false;
    
    //initialize the cached registers in the device context
    pdevice->deviceID_cached = false;
    pdevice->negPwrFsr_LAT_cached = false;
    pdevice->ctrl_LAT_cached = false;
    pdevice->accumConfig_LAT_cached = false;
    for (i=0; i<PAC194X5X_MAX_CH_COUNT; i++){
        pdevice->ScaleValues_cached[i] = false;
    }
    
    //store the sense resistor values in the device context
    //and initialize the VrailToVbusRatio vector
    for(i = 0; i < PAC194X5X_MAX_CH_COUNT; i++){
        pdevice->rsense[i] = prsense[i];
        pdevice->VrailToVbusRatio[i] = 1.0;
    }
    
    //read and store the device IDs in the device context
    errorCode = PAC194x5x_GetDeviceID(pdevice, &pdevice->deviceID);
    if(errorCode != PAC194X5X_SUCCESS) goto Device_Initialize_exit;
    pdevice->deviceID_cached = true;
    
    //set the device specific properties in the device context
    pdevice->VsenseFSR = 100;           //milliVolts
    
    switch (pdevice->deviceID.product){
        //PAC194x family
        case 0b01101000:{               //0x68 - PAC1941
            pdevice->HwChannels = 1;
            pdevice->LowSide = 0;
            pdevice->VbusFSR = 9000;    //milliVolts
            pdevice->VPowerFSR = 900;   //milli-Volt^2
            break;
        }
        case 0b01101001:{               //0x69 - PAC1942
            pdevice->HwChannels = 2;
            pdevice->LowSide = 0;
            pdevice->VbusFSR = 9000;    //milliVolts
            pdevice->VPowerFSR = 900;   //milli-Volt^2
            break;
        }
        case 0b01101010:{               //0x6A - PAC1943
            pdevice->HwChannels = 3;
            pdevice->LowSide = 0;
            pdevice->VbusFSR = 9000;    //milliVolts
            pdevice->VPowerFSR = 900;   //milli-Volt^2
            break;
        }
        case 0b01101011:{               //0x6B - PAC1944
            pdevice->HwChannels = 4;
            pdevice->LowSide = 0;
            pdevice->VbusFSR = 9000;    //milliVolts
            pdevice->VPowerFSR = 900;   //milli-Volt^2
            break;
        }
        case 0b01101100:{               //0x6C - PAC1941-2
            pdevice->HwChannels = 1;
            pdevice->LowSide = 1;
            pdevice->VbusFSR = 9000;    //milliVolts
            pdevice->VPowerFSR = 900;   //milli-Volt^2
            pdevice->VrailToVbusRatio[0] = VrailToVbusRatio[0];
            break;
        }
        case 0b01101101:{               //0x6D - PAC1942-2
            pdevice->HwChannels = 2;
            pdevice->LowSide = 1;
            pdevice->VbusFSR = 9000;    //milliVolts
            pdevice->VPowerFSR = 900;   //milli-Volt^2
            pdevice->VrailToVbusRatio[0] = VrailToVbusRatio[0];
            pdevice->VrailToVbusRatio[1] = VrailToVbusRatio[1];
            break;
        }
        
        //PAC195x family
        case 0b01111000:{               //0x78 - PAC1951
            pdevice->HwChannels = 1;
            pdevice->LowSide = 0;
            pdevice->VbusFSR = 32000;   //milliVolts
            pdevice->VPowerFSR = 3200;  //milli-Volt^2
            break;
        }
        case 0b01111001:{               //0x79 - PAC1952
            pdevice->HwChannels = 2;
            pdevice->LowSide = 0;
            pdevice->VbusFSR = 32000;   //milliVolts
            pdevice->VPowerFSR = 3200;  //milli-Volt^2
            break;
        }
        case 0b01111010:{               //0x7A - PAC1953
            pdevice->HwChannels = 3;
            pdevice->LowSide = 0;
            pdevice->VbusFSR = 32000;   //milliVolts
            pdevice->VPowerFSR = 3200;  //milli-Volt^2
            break;
        }
        case 0b01111011:{               //0x7B - PAC1954
            pdevice->HwChannels = 4;
            pdevice->LowSide = 0;
            pdevice->VbusFSR = 32000;   //milliVolts
            pdevice->VPowerFSR = 3200;  //milli-Volt^2
            break;
        }
        case 0b01111100:{               //0x7C - PAC1951-2
            pdevice->HwChannels = 1;
            pdevice->LowSide = 1;
            pdevice->VbusFSR = 32000;   //milliVolts
            pdevice->VPowerFSR = 3200;  //milli-Volt^2
            pdevice->VrailToVbusRatio[0] = VrailToVbusRatio[0];
            break;
        }
        case 0b01111101:{               //0x7D - PAC1952-2
            pdevice->HwChannels = 2;
            pdevice->LowSide = 1;
            pdevice->VbusFSR = 32000;   //milliVolts
            pdevice->VPowerFSR = 3200;  //milli-Volt^2
            pdevice->VrailToVbusRatio[0] = VrailToVbusRatio[0];
            pdevice->VrailToVbusRatio[1] = VrailToVbusRatio[1];
            break;
        }
        default:
            errorCode = PAC194X5X_INVALID_DEVICE;
            return errorCode;
    }
    
    // Section 2 - initialization of the device configuration
    
    // Configure CTRL - 0x0700
    PAC194X5X_CTRL_REGISTER Ctrl;
    PAC194X5X_CTRL_REGISTER getCtrl;
    Ctrl.SAMPLE_MODE = 0b0010; // 64 SPS
    //Ctrl.SAMPLE_MODE = 0b0000; //VIN - 1024 SPS adaptive accumulation
    Ctrl.GPIO_ALERT2 = 0b00; // ALERT2 func
    Ctrl.SLOW_ALERT1 = 0b11; // SLOW func by default. But pin is GNDed, hence SLOW Sampling will not occur
    Ctrl.CH1_OFF = 0b0;
    Ctrl.CH2_OFF = 0b0;
    //Ctrl.CH3_OFF = 0b0;
    //Ctrl.CH4_OFF = 0b0;
    Ctrl.CH3_OFF = 0b1; //VIN Disable ch3
    Ctrl.CH4_OFF = 0b1;  //VIN Disable ch4
    errorCode = PAC194x5x_SetCtrl_reg(pdevice, Ctrl);    
    if(errorCode != PAC194X5X_SUCCESS) goto Device_Initialize_exit;
    
    errorCode = PAC194x5x_Refresh(pdevice);      //added line
    vTaskDelay(1/ portTICK_RATE_MS);            //added line

    errorCode = PAC194x5x_GetCtrl_reg(pdevice,1,&getCtrl);
    // ESP_LOGI("CONTROL REG","SLOW_ALT: %d", getCtrl.SLOW_ALERT1);
    // ESP_LOGI("CONTROL REG","CH2_OFF: %d", getCtrl.CH2_OFF);

    // Configure SMBUS_SETTINGS - 0x10
    PAC194X5X_SMBUS_SETTINGS_REGISTER SMBus;
    SMBus.GPIO_DATA2 = 0b0;
    SMBus.GPIO_DATA1 = 0b0;
    SMBus.ANY_ALERT = 0b0;
    SMBus.POR = 0b1;    //keep the flag value as is
    SMBus.TIMEOUT = 0b0;
    SMBus.BYTE_COUNT = 0b0;
    SMBus.NO_SKIP = 0b0;
    SMBus.I2C_HISPEED = 0b0;
    errorCode = PAC194x5x_SetSMBusSettings_reg(pdevice, SMBus);    
    if(errorCode != PAC194X5X_SUCCESS) goto Device_Initialize_exit;
    
    // Configure NEG_PWR_FSR - 0x0000
    PAC194X5X_NEG_PWR_FSR_REGISTER NegPwr;
    NegPwr.CFG_VS1 = 0b01;   //Channel 1 VSENSE has bipolar +100 mV to -100 mV FSR
    //NegPwr.CFG_VS2 = 0b01;   //Channel 2 VSENSE has bipolar +100 mV to -100 mV FSR
    NegPwr.CFG_VS2 = 0b00;   //Channel 2 VSENSE has unipolar +100 mV to 0 mV FSR // VIN
    NegPwr.CFG_VS3 = 0b00;
    NegPwr.CFG_VS4 = 0b00;
    NegPwr.CFG_VB1 = 0b00; //Channel 1 VBUS has unipolar +32V to 0V FSR (default)
    NegPwr.CFG_VB2 = 0b00; //Channel 2 VBUS has unipolar +32V to 0V FSR (default)
    NegPwr.CFG_VB3 = 0b00;
    NegPwr.CFG_VB4 = 0b00;
    errorCode = PAC194x5x_SetNegPwrFsr_reg(pdevice, NegPwr);    
    if(errorCode != PAC194X5X_SUCCESS) goto Device_Initialize_exit;   

    // Configure SLOW - 0x00
    PAC194X5X_SLOW_REGISTER Slow;
    Slow.RefreshRise = 0b0;
    Slow.RefreshVRise = 0b0;
    Slow.RefreshFall = 0b0;
    Slow.RefreshVFall = 0b0;
    errorCode = PAC194x5x_SetSlow_reg(pdevice, Slow);
    if(errorCode != PAC194X5X_SUCCESS) goto Device_Initialize_exit;

    // Configure ACCUM_CONFIG - 0x00
    PAC194X5X_ACCUM_CONFIG_REGISTER AccCfg;
    AccCfg.ACC1_CONFIG = 0b00;
    AccCfg.ACC2_CONFIG = 0b00;
    //AccCfg.ACC3_CONFIG = 0b00;
    //AccCfg.ACC4_CONFIG = 0b00;
    AccCfg.ACC3_CONFIG = 0b11; //VIN 
    AccCfg.ACC4_CONFIG = 0b11; //VIN
    errorCode = PAC194x5x_SetAccumConfig_reg(pdevice, AccCfg);
    if(errorCode != PAC194X5X_SUCCESS) goto Device_Initialize_exit;
    
    // Configure ACC_Fullness_limits - 0x5540
    PAC194X5X_ACCUM_LIMITS_REGISTER AccLimits;
    AccLimits.ACC_CH1 = 0b01;
    AccLimits.ACC_CH2 = 0b01;
    AccLimits.ACC_CH3 = 0b01;
    AccLimits.ACC_CH4 = 0b01;
    AccLimits.ACC_COUNT = 0b01;
    errorCode = PAC194x5x_SetAccFullness_reg(pdevice, AccLimits);
    if(errorCode != PAC194X5X_SUCCESS) goto Device_Initialize_exit;
    
    // Configure ALERT_ENABLE - 0x000000
    PAC194X5X_ALERT_REGISTER AlertEnable;

    memset(&AlertEnable, 0, sizeof(PAC194X5X_ALERT_REGISTER));

