NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
    errorCode = PAC194x5x_GetAlertEnable_reg(pdevice, &AlertEnable); //read the ALERT_ENABLE register //added line
     ESP_LOGI("DEVICE INIT","Before set CH2_OV: %d", AlertEnable.CH2_OV); //added line


    errorCode = PAC194x5x_SetAlertEnable_reg(pdevice, AlertEnable);
    if(errorCode != PAC194X5X_SUCCESS) goto Device_Initialize_exit;

   
    errorCode = PAC194x5x_Refresh(pdevice);    // the REFRESH ensures that the configuration
                                               // changes are 
                                               
    errorCode = PAC194x5x_GetAlertEnable_reg(pdevice, &AlertEnable); //read the ALERT_ENABLE register
    ESP_LOGI("DEVICE INIT"," CH2_OV: %d", AlertEnable.CH2_OV);                                           

Device_Initialize_exit:
    return errorCode;
}

esp_err_t pac1952_busy(){
    esp_err_t errorCode = -1,_pac1952_stat = -1;
    uint8_t num_retry = 0;
    i2c_cmd_handle_t cmd;
    while(1){
        vTaskDelay(10/ portTICK_RATE_MS);
        cmd = i2c_cmd_link_create();
        errorCode = i2c_master_start(cmd);
        if(errorCode != ESP_OK) {
            goto ErrorHandler;
        }
        errorCode = i2c_master_write_byte(cmd, (PAC194X5X_CLIENT_ADDRESS_1) | WRITE_BIT, ACK_CHECK_EN);
        if(errorCode != ESP_OK) {
            goto ErrorHandler;
        }
        errorCode = i2c_master_stop(cmd);
        if(errorCode != ESP_OK) {
            goto ErrorHandler;
        }
        _pac1952_stat = i2c_master_cmd_begin(i2c_num, cmd, 1000 / portTICK_RATE_MS);
        if(_pac1952_stat != ESP_OK) {
            goto ErrorHandler;
        }

ErrorHandler:
        i2c_cmd_link_delete(cmd);
        num_retry++;
        if((num_retry > 10 ) || (_pac1952_stat == 0)){
            break;
        }
    }
    return (errorCode);
}

/* PAC194x5x_Write() and 
 * PAC194x5x_Read() implementation 
 * with "Foundation Services" I2C support API
 */
#if defined(I2C_FSERV_ENABLED)
/* WARNING: Foundation Services supports only one I2C host by default
            Consequently, i2cBusID is not used in this implementation. */
uint16_t PAC194x5x_Write(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t *pdata, uint8_t length){
    i2c_writeNBytes(pdevice->i2cAddress, pdata, length);
    return PAC194X5X_SUCCESS;
}


uint16_t PAC194x5x_Read(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t *pdata, uint8_t *plength){
    uint8_t byteCount;
    int i;
    
    byteCount = *plength;
    if(pdevice->ENABLE_BYTE_COUNT_FLAG == true){
        //in SMBUS block read protocol, the number of read bytes is inserted 
        //before the actual data bytes
        byteCount += SMBUS_BYTECNT;
    }
    
    //read the register value
    i2c_readNBytes(pdevice->i2cAddress, pdata, byteCount);

    if(pdevice->ENABLE_BYTE_COUNT_FLAG == true){
        //SMBUS mode
        byteCount = pdata[0];
        //move the data to the beginning of the read buffer
        for(i=0; i < *plength; i++){
            *(pdata + i) = *(pdata + i + SMBUS_BYTECNT);
        }
        
        *plength = byteCount;
    }
    return PAC194X5X_SUCCESS;
}
#endif // defined(I2C_FSERV_ENABLED)



esp_err_t PAC194x5x_Write(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t *pdata, uint8_t length){

    esp_err_t errorCode = 0;
    uint8_t i2c_retry_cnt = 2;
    // Try to get i2c bus lock before performing i2c operation
    if(lock_i2c_bus(3000) == true) { // Max wait time to obtain lock is 3 sec
        i2c_cmd_handle_t cmd;
        do {
            cmd = i2c_cmd_link_create();
            errorCode = i2c_master_start(cmd);
            if(errorCode != ESP_OK) {
                goto ErrorHandling;
            }
            errorCode = i2c_master_write_byte(cmd, pdevice->i2cAddress | WRITE_BIT, ACK_CHECK_EN);
            if(errorCode != ESP_OK) {
                goto ErrorHandling;
            }
            errorCode = i2c_master_write(cmd,pdata,length, ACK_CHECK_EN);
            if(errorCode != ESP_OK) {
                goto ErrorHandling;
            }
            errorCode = i2c_master_stop(cmd);
            if(errorCode != ESP_OK) {
                goto ErrorHandling;
            }
            errorCode = i2c_master_cmd_begin(i2c_num, cmd, 1000 / portTICK_RATE_MS);
            if(errorCode != ESP_OK) {
                i2c_retry_cnt--;
                if(!i2c_retry_cnt) {
                    ESP_LOGI("PAC194x5x_Write","i2c cmd begin: %s",esp_err_to_name(errorCode));
                    goto ErrorHandling;
                }
                i2c_cmd_link_delete(cmd);
                vTaskDelay(100/portTICK_RATE_MS);
            } else {
                break;
            }
        } while(i2c_retry_cnt);
        
        i2c_cmd_link_delete(cmd);
        // Unlock the locked resource
        unlock_i2c_bus();

        return (errorCode);

ErrorHandling:
        ESP_LOGI("PAC194x5x_Write" , "Error code: %s\n",esp_err_to_name(errorCode)); //VIN
        i2c_cmd_link_delete(cmd);
        // Unlock the locked resource
        unlock_i2c_bus();
    } else {
        ESP_LOGI("PAC194x5x_Write" , "Failed to get i2c bus lock"); //VIN
        errorCode = -1;
    }
    return (errorCode);
}

esp_err_t PAC194x5x_Read(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t *pdata, uint8_t *plength){

    uint8_t len;
    esp_err_t errorCode = 0;
    uint8_t i2c_retry_cnt = 2;

    len = *plength;
    if(lock_i2c_bus(3000) == true) { // Max wait time to obtain lock is 3 sec
        i2c_cmd_handle_t cmd;
        do {
            cmd = i2c_cmd_link_create();
            errorCode = i2c_master_start(cmd);
            if(errorCode != ESP_OK) {
                goto ErrorHandling;
            }
            errorCode = i2c_master_write_byte(cmd, pdevice->i2cAddress | READ_BIT, ACK_CHECK_EN);
            if(errorCode != ESP_OK) {
                goto ErrorHandling;
            }
            if(len > 1){
                errorCode = i2c_master_read(cmd,pdata,len-1,ACK_VAL);
                if(errorCode != ESP_OK) {
                    goto ErrorHandling;
                }
            }
            errorCode = i2c_master_read_byte(cmd, pdata + len - 1, NACK_VAL);
            if(errorCode != ESP_OK) {
                goto ErrorHandling;
            }
            errorCode = i2c_master_stop(cmd);
            if(errorCode != ESP_OK) {
                goto ErrorHandling;
            }
            errorCode = i2c_master_cmd_begin(i2c_num, cmd, 1000 / portTICK_RATE_MS);
            if(errorCode != ESP_OK) {
                i2c_retry_cnt--;
                if(!i2c_retry_cnt) {
                    ESP_LOGI("PAC194x5x_Read","i2c cmd begin : %s",esp_err_to_name(errorCode));
                    goto ErrorHandling;
                }
                i2c_cmd_link_delete(cmd);
                vTaskDelay(100/portTICK_RATE_MS);
            } else {
                break;
            }
        } while(i2c_retry_cnt);

        i2c_cmd_link_delete(cmd);
        // Unlock the locked resource
        unlock_i2c_bus();
        return (errorCode);

ErrorHandling:
        ESP_LOGI("PAC194x5x_Read" , "Error code: %s\n",esp_err_to_name(errorCode)); //VIN
        i2c_cmd_link_delete(cmd);
        // Unlock the locked resource
        unlock_i2c_bus();
        return (errorCode);
    } else {
        ESP_LOGI("PAC194x5x_Read" , "Failed to get i2c bus lock"); //VIN
        errorCode = -1;
    }
    return (errorCode);
}

