NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
uint16_t PAC194x5x_GetDeviceID(PPAC194X5X_DEVICE_CONTEXT pdevice, PPAC194X5X_deviceID pdeviceID){
    uint8_t readBuffer[1+SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_IDREG_SZ;
    //step 1 - read from the PRODUCT_ID device register - 1 byte
    //set the device register pointer
    registerPointer = PAC194X5X_PRODUCT_ID_ADDR;
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;

    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    pdeviceID->product = readBuffer[0];
    
    //step 2 - read from the MANUFACTURER_ID device register - 1 byte
    //set the device register pointer
    registerPointer = PAC194X5X_MANUFACTURER_ID_ADDR;
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    pdeviceID->manufacturer = readBuffer[0];
    
    //step 3 - read from the REVISION_ID device register - 1 byte
    //set the device register pointer
    registerPointer = PAC194X5X_REVISION_ID_ADDR;
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    pdeviceID->revision = readBuffer[0];
    
    return PAC194X5X_SUCCESS;
}


uint16_t PAC194x5x_Refresh(PPAC194X5X_DEVICE_CONTEXT pdevice){
    uint8_t writeBuffer[1];
    uint16_t errorCode;
    
    // invalidate the device context cache flags
    pdevice->negPwrFsr_LAT_cached = false;
    pdevice->ctrl_LAT_cached = false;
    pdevice->accumConfig_LAT_cached = false;
    
    writeBuffer[0] = PAC194X5X_REFRESH_ADDR;
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    return errorCode;
}


uint16_t PAC194x5x_RefreshG(PPAC194X5X_DEVICE_CONTEXT pdevice){
    uint8_t writeBuffer[1];
    uint16_t errorCode;

    // invalidate the device context cache flags
    pdevice->negPwrFsr_LAT_cached = false;
    pdevice->ctrl_LAT_cached = false;
    pdevice->accumConfig_LAT_cached = false;
    
    writeBuffer[0] = PAC194X5X_REFRESH_G_ADDR;
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    return errorCode;
}


uint16_t PAC194x5x_RefreshV(PPAC194X5X_DEVICE_CONTEXT pdevice){
    uint8_t writeBuffer[1];
    uint16_t errorCode;

    // invalidate the device context cache flags
    pdevice->negPwrFsr_LAT_cached = false;
    pdevice->ctrl_LAT_cached = false;
    pdevice->accumConfig_LAT_cached = false;    
    
    writeBuffer[0] = PAC194X5X_REFRESH_V_ADDR;
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    return errorCode;
}


uint16_t PAC194x5x_GetCtrl_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t reg_select, PPAC194X5X_CTRL_REGISTER pCtrl_reg){
    uint8_t readBuffer[PAC194X5X_CTRL_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_CTRL_SZ;
    switch(reg_select){
        case 1:
            registerPointer = PAC194X5X_CTRL_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_CTRL_ACT_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_CTRL_LAT_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;

    ESP_LOGI("GET_CTRL","get ctrl val: %d %d %d", readBuffer[0],readBuffer[1],readBuffer[2]); // added line

    // We can let pCtrl_reg == NULL if we only need the context CTRL_LAT update
    if (pCtrl_reg != NULL){
        memcpy(pCtrl_reg, readBuffer, sizeof(PAC194X5X_CTRL_REGISTER));
    }
    
    // cache the CTRL_LAT value in the device context
    if (reg_select == 3){
        memcpy(&pdevice->ctrl_LAT, readBuffer, sizeof(PAC194X5X_CTRL_REGISTER));
        pdevice->ctrl_LAT_cached = true;
    }    
    
    return errorCode;
}


uint16_t PAC194x5x_SetCtrl_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PAC194X5X_CTRL_REGISTER Ctrl_reg){
    uint8_t writeBuffer[PAC194X5X_CTRL_SZ + 1];
    void *pwriteBuffer;
    uint16_t errorCode;
    
    pwriteBuffer = &Ctrl_reg;
    writeBuffer[0] = PAC194X5X_CTRL_ADDR;
    memcpy( writeBuffer+1, (uint8_t*)pwriteBuffer, sizeof(PAC194X5X_CTRL_REGISTER));

    ESP_LOGI("SET_CTRL","CTRL_REG: %d %d", writeBuffer[1],writeBuffer[2]);//added line

    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    // invalidate the cached CTRL_LAT value in the device context
    pdevice->ctrl_LAT_cached = false;
    
    return errorCode;
}


uint16_t PAC194x5x_GetAccumulatorCount(PPAC194X5X_DEVICE_CONTEXT pdevice, uint32_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_ACC_COUNT_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_ACC_COUNT_SZ;
    registerPointer = PAC194X5X_ACC_COUNT_ADDR;
                
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pregister_val = readBuffer[0];
    *pregister_val = (*pregister_val << 8) + readBuffer[1];
    *pregister_val = (*pregister_val << 8) + readBuffer[2];
    *pregister_val = (*pregister_val << 8) + readBuffer[3];
    
    return errorCode;   
}


#ifdef __XC8__
uint16_t PAC194x5x_GetVACCn_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint8_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_VACCN_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    int8_t i;
    
    byteCount = PAC194X5X_VACCN_SZ;
    
