NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
    switch(channelNo){
        case 1:
            registerPointer = PAC194X5X_VACC1_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_VACC2_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_VACC3_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_VACC4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    for(i = 0; i < 7; i++){                 
       *(pregister_val + i) = readBuffer[i];
    }
    
    return errorCode;
}

#else   // __XC16__ or __XC32__
uint16_t PAC194x5x_GetVACCn_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint64_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_VACCN_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_VACCN_SZ;
    
    switch(channelNo){
        case 1:
            registerPointer = PAC194X5X_VACC1_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_VACC2_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_VACC3_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_VACC4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pregister_val = readBuffer[0];
    *pregister_val = (*pregister_val << 8) + readBuffer[1];
    *pregister_val = (*pregister_val << 8) + readBuffer[2];
    *pregister_val = (*pregister_val << 8) + readBuffer[3];
    *pregister_val = (*pregister_val << 8) + readBuffer[4];
    *pregister_val = (*pregister_val << 8) + readBuffer[5];
    *pregister_val = (*pregister_val << 8) + readBuffer[6];
    
    return errorCode;
}
#endif


#ifdef __XC8__
uint16_t PAC194x5x_GetVACCn_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue, uint8_t* pmode){
    uint8_t VAccReg[PAC194X5X_VACCN_SZ];
    float VpowerAccReal, PowerUnit;
    float VsenseAccReal, VsenseLsb;
    float VbusAccReal, VbusLsb;
    uint32_t highPart, lowPart;
    uint16_t errorCode;
    uint8_t mode;

    //Make sure that cached ACCUM_CONFIG_LAT value is valid
    errorCode = PAC194x5x_UpdateContext_AccumConfig(pdevice);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    switch(channelNo){
        case 1:
            mode = pdevice->accumConfig_LAT.ACC1_CONFIG;
            break;
        case 2:
            mode = pdevice->accumConfig_LAT.ACC2_CONFIG;
            break;
        case 3:
            mode = pdevice->accumConfig_LAT.ACC3_CONFIG;
            break;
        case 4:
            mode = pdevice->accumConfig_LAT.ACC4_CONFIG;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    *pmode = mode;
    
    errorCode = PAC194x5x_GetVACCn_reg(pdevice, channelNo, VAccReg);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    errorCode = PAC194x5x_UpdateContext_ChannelPolarity(pdevice, channelNo);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
       
    highPart = VAccReg[0];
    highPart = (highPart << 8) + VAccReg[1];
    highPart = (highPart << 8) + VAccReg[2];
    lowPart = VAccReg[3];
    lowPart = (lowPart << 8) + VAccReg[4];
    lowPart = (lowPart << 8) + VAccReg[5];
    lowPart = (lowPart << 8) + VAccReg[6];
    
    switch(mode){
        case 0: //Power accumulator - mode 0 - milliWatt
            
            if(pdevice->IsSignedPower[channelNo-1] == 1){
                if( (highPart & 0x800000) != 0 ){
                    highPart = highPart | 0xFF800000; //sign extension
                }
                VpowerAccReal = (float)((int32_t)highPart);
            }else{
                VpowerAccReal = (float)(highPart);
            }


            PowerUnit = (float)pdevice->VPowerScale[channelNo-1] * 1000000 / pdevice->rsense[channelNo-1];
            PowerUnit = PowerUnit / 1073741824.0;   // milli-Watts/bit
            
            VpowerAccReal = (VpowerAccReal * 4294967296) + (float)lowPart;
            *pvalue = VpowerAccReal * PowerUnit;

            if(pdevice->LowSide == 1) *pvalue *= pdevice->VrailToVbusRatio[channelNo-1];
            break;
            
        case 1: //Vsense accumulator - mode 1 - milliVolt
            if(pdevice->IsSignedVsense[channelNo-1] == 1){
                if( (highPart & 0x800000) != 0 ){
                    highPart = highPart | 0xFF800000; //sign extension
                }
                VsenseAccReal = (float)((int32_t)highPart);
            }else{
                VsenseAccReal = (float)(highPart);
            }
            
            VsenseLsb = (pdevice->VsenseScale[channelNo-1]) / 65536.0;
            VsenseAccReal = (VsenseAccReal * 4294967296) + (float)lowPart;
            *pvalue = VsenseAccReal * VsenseLsb; //mV
            break;
            
        case 2: //Vbus accumulator  - mode 2 - milliVolt
            if(pdevice->IsSignedVbus[channelNo-1] == 1){
                if( (highPart & 0x800000) != 0 ){
                    highPart = highPart | 0xFF800000; //sign extension
                }
                VbusAccReal = (float)((int32_t)highPart);
            }else{
                VbusAccReal = (float)(highPart);
            }
            
            VbusLsb = (pdevice->VbusScale[channelNo-1]) / 65536.0;
            VbusAccReal = (VbusAccReal * 4294967296) + (float)lowPart;
            *pvalue = VbusAccReal * VbusLsb; //mV
            
            if(pdevice->LowSide == 1) *pvalue *= pdevice->VrailToVbusRatio[channelNo-1];
            break;

        default:
            errorCode = PAC194X5X_INVALID_ACCUMULATION_MODE;
            return errorCode;      
    }
       
    return errorCode;
}

