NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
#else   // __XC16__ or __XC32__
uint16_t PAC194x5x_GetVACCn_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue, uint8_t* pmode){
    uint64_t VAccReg;
    float VpowerAccReal, PowerUnit;
    float VsenseAccReal, VsenseLsb;
    float VbusAccReal, VbusLsb;
    uint16_t errorCode;
    uint8_t mode;

    //Make sure that cached ACCUM_CONFIG_LAT value is valid
    errorCode = PAC194x5x_UpdateContext_AccumConfig(pdevice);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    switch(channelNo){
        case 1:
            mode = pdevice->accumConfig_LAT.ACC1_CONFIG;
            break;
        case 2:
            mode = pdevice->accumConfig_LAT.ACC2_CONFIG;
            break;
        case 3:
            mode = pdevice->accumConfig_LAT.ACC3_CONFIG;
            break;
        case 4:
            mode = pdevice->accumConfig_LAT.ACC4_CONFIG;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    *pmode = mode;
    
    errorCode = PAC194x5x_GetVACCn_reg(pdevice, channelNo, &VAccReg);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    errorCode = PAC194x5x_UpdateContext_ChannelPolarity(pdevice, channelNo);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    switch(mode){
        case 0: //Power accumulator - mode 0 - milliWatt
            
            if(pdevice->IsSignedPower[channelNo-1] == 1){
                if( (VAccReg & 0x80000000000000) == 0x80000000000000){
                    VAccReg = VAccReg | 0xFF80000000000000; //sign extension
                }
                VpowerAccReal = (float)((int64_t)VAccReg);
            }else{
                VpowerAccReal = (float)(VAccReg);
            }

            PowerUnit = (float)pdevice->VPowerScale[channelNo-1] * 1000000 / pdevice->rsense[channelNo-1];
            PowerUnit = PowerUnit / 1073741824.0;   // milli-Watts/bit
            
            *pvalue = VpowerAccReal * PowerUnit;

            if(pdevice->LowSide == 1) *pvalue *= pdevice->VrailToVbusRatio[channelNo-1];
            
            break;
            
        case 1: //Vsense accumulator - mode 1 - milliVolt
            if(pdevice->IsSignedVsense[channelNo-1] == 1){
                if( (VAccReg & 0x80000000000000) == 0x80000000000000){
                    VAccReg = VAccReg | 0xFF80000000000000; //sign extension
                }
                VsenseAccReal = (float)((int64_t)VAccReg);
            }else{
                VsenseAccReal = (float)(VAccReg);
            }
            
            VsenseLsb = (pdevice->VsenseScale[channelNo-1]) / 65536.0;
            *pvalue = VsenseAccReal * VsenseLsb; //mV                       
            break;
            
        case 2: //Vbus accumulator  - mode 2 - milliVolt
            if(pdevice->IsSignedVbus[channelNo-1] == 1){
                if( (VAccReg & 0x80000000000000) == 0x80000000000000){
                    VAccReg = VAccReg | 0xFF80000000000000; //sign extension
                }
                VbusAccReal = (float)((int64_t)VAccReg);
            }else{
                VbusAccReal = (float)(VAccReg);
            }
            
            VbusLsb = (pdevice->VbusScale[channelNo-1]) / 65536.0;
            VbusAccReal = VbusAccReal * VbusLsb; //mV
            *pvalue = VbusAccReal;
            
            if(pdevice->LowSide == 1) *pvalue *= pdevice->VrailToVbusRatio[channelNo-1];
            break;

        default:
            errorCode = PAC194X5X_INVALID_ACCUMULATION_MODE;
            return errorCode;      
    }
       
    return errorCode;
}
#endif

uint16_t PAC194x5x_GetVBUSn_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint16_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_VBUS_VSENSE_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    if (channelNo > (pdevice->HwChannels)){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;
    }  

    byteCount = PAC194X5X_VBUS_VSENSE_SZ;
    
    switch(channelNo){
        case 1:
            registerPointer = PAC194X5X_VBUS1_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_VBUS2_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_VBUS3_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_VBUS4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pregister_val = readBuffer[0];
    *pregister_val = (*pregister_val << 8) + readBuffer[1];
    
    return errorCode;
}


uint16_t PAC194x5x_GetVBUSn_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    uint16_t errorCode;
    uint16_t VbusReg;
    float VbusReal;
    
    errorCode = PAC194x5x_GetVBUSn_reg(pdevice, channelNo, &VbusReg);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    errorCode = PAC194x5x_UpdateContext_ChannelPolarity(pdevice, channelNo);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
        
    if (pdevice->IsSignedVbus[channelNo-1] == 1){
        int16_t signedReg;
        int32_t tempProd;
        signedReg = (int16_t)VbusReg;
        tempProd = (int32_t)signedReg * (int32_t)pdevice->VbusScale[channelNo - 1];
        VbusReal = (float)tempProd;
    }else{
        uint32_t tempProd;
        tempProd = (uint32_t)VbusReg * (uint32_t)pdevice->VbusScale[channelNo - 1];
        VbusReal = (float)tempProd;
    }
    
