NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
    *pvalue = VbusReal / 65536.0;    //mV
    if(pdevice->LowSide == 1) *pvalue *= pdevice->VrailToVbusRatio[channelNo-1];    
    
    return errorCode;
}


uint16_t PAC194x5x_GetVSENSEn_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint16_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_VBUS_VSENSE_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
 
    if (channelNo > (pdevice->HwChannels)){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;
    }
    
    byteCount = PAC194X5X_VBUS_VSENSE_SZ;
    
    switch(channelNo){
        case 1:
            registerPointer = PAC194X5X_VSENSE1_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_VSENSE2_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_VSENSE3_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_VSENSE4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pregister_val = readBuffer[0];
    *pregister_val = (*pregister_val << 8) + readBuffer[1];
    
    ESP_LOGI("Vbus","\nCH2 Vbus raw: %d",  *pregister_val);
    return errorCode;
}


uint16_t PAC194x5x_GetVSENSEn_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    uint16_t errorCode;
    uint16_t VsenseReg;
    float VsenseReal;
    
    errorCode = PAC194x5x_GetVSENSEn_reg(pdevice, channelNo, &VsenseReg);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    errorCode = PAC194x5x_UpdateContext_ChannelPolarity(pdevice, channelNo);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
        
    if (pdevice->IsSignedVsense[channelNo-1] == 1){
        int16_t signedReg;
        int32_t tempProd;
        signedReg = (int16_t)VsenseReg;
        tempProd = (int32_t)signedReg * (int32_t)pdevice->VsenseScale[channelNo - 1];
        VsenseReal = (float)tempProd;
    }else{
        uint32_t tempProd;
        tempProd = (uint32_t)VsenseReg * (uint32_t)pdevice->VsenseScale[channelNo - 1];
        VsenseReal = (float)tempProd;
    }
    
    *pvalue = VsenseReal / 65536.0;    //mV
    
    return errorCode;   
}


uint16_t PAC194x5x_GetISENSEn_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    float VsenseReal;
    uint16_t errorCode;
    
    errorCode = PAC194x5x_GetVSENSEn_real(pdevice, channelNo, &VsenseReal);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pvalue = ( VsenseReal * 1000000 ) / (pdevice->rsense[channelNo-1]);     //mA
    
    return errorCode;
}


uint16_t PAC194x5x_GetVBUSn_AVG_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint16_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_VBUS_VSENSE_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;

    memset(&readBuffer,0,sizeof(readBuffer));
    if (channelNo > (pdevice->HwChannels)){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;
    }
    
    byteCount = PAC194X5X_VBUS_VSENSE_SZ;
    
    switch(channelNo){
        case 1:
            registerPointer = PAC194X5X_VBUS1_AVG_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_VBUS2_AVG_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_VBUS3_AVG_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_VBUS4_AVG_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    vTaskDelay(10/ portTICK_RATE_MS);
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pregister_val = readBuffer[0];
    *pregister_val = (*pregister_val << 8) + readBuffer[1];
    //ESP_LOGI("Vbusavg","CH[%d] Vbus avg: %d",channelNo,  *pregister_val);
    return errorCode;
}

uint16_t PAC194x5x_GetVBUSn_AVG_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    uint16_t errorCode;
    uint16_t VbusReg;
    float VbusReal;
    
    errorCode = PAC194x5x_GetVBUSn_AVG_reg(pdevice, channelNo, &VbusReg);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    errorCode = PAC194x5x_UpdateContext_ChannelPolarity(pdevice, channelNo);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
        
    if (pdevice->IsSignedVbus[channelNo-1] == 1){
        int16_t signedReg;
        int32_t tempProd;
        signedReg = (int16_t)VbusReg;
        tempProd = (int32_t)signedReg * (int32_t)pdevice->VbusScale[channelNo - 1];
        VbusReal = (float)tempProd;
    }else{
        uint32_t tempProd;
        tempProd = (uint32_t)VbusReg * (uint32_t)pdevice->VbusScale[channelNo - 1];
        VbusReal = (float)tempProd;
    }
    
    *pvalue = VbusReal / 65536.0;    //mV
    if(pdevice->LowSide == 1) *pvalue *= pdevice->VrailToVbusRatio[channelNo-1];     
    
    return errorCode;
}


uint16_t PAC194x5x_GetVSENSEn_AVG_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint16_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_VBUS_VSENSE_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer = 0;
    uint8_t byteCount = 0;
    uint16_t errorCode = 0;
    memset(&readBuffer,0,sizeof(readBuffer));

    if (channelNo > (pdevice->HwChannels)){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;
    }    
    byteCount = PAC194X5X_VBUS_VSENSE_SZ;
    
