NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
    switch(channelNo){
        case 1:
            registerPointer = PAC194X5X_VSENSE1_AVG_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_VSENSE2_AVG_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_VSENSE3_AVG_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_VSENSE4_AVG_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    vTaskDelay(10/ portTICK_RATE_MS);
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pregister_val = readBuffer[0];
    *pregister_val = (*pregister_val << 8) + readBuffer[1];
    //ESP_LOGI("VSenseavg","CH[%d] VSense avg: %d",channelNo,  (int16_t)*pregister_val); 
    return errorCode;
}

uint16_t PAC194x5x_GetVSENSEn_AVG_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    uint16_t errorCode;
    uint16_t VsenseReg;
    float VsenseReal;
    
    errorCode = PAC194x5x_GetVSENSEn_AVG_reg(pdevice, channelNo, &VsenseReg);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    errorCode = PAC194x5x_UpdateContext_ChannelPolarity(pdevice, channelNo);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
        
    if (pdevice->IsSignedVsense[channelNo-1] == 1){
        int16_t signedReg;
        int32_t tempProd;
        signedReg = (int16_t)VsenseReg;
        tempProd = (int32_t)signedReg * (int32_t)pdevice->VsenseScale[channelNo - 1];
        VsenseReal = (float)tempProd;
    }else{
        uint32_t tempProd;
        tempProd = (uint32_t)VsenseReg * (uint32_t)pdevice->VsenseScale[channelNo - 1];
        VsenseReal = (float)tempProd;
    }
    
    *pvalue = VsenseReal / 65536.0;    //mV
    
    return errorCode;   
}


uint16_t PAC194x5x_GetISENSEn_AVG_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    float VsenseAvgReal;
    uint16_t errorCode;
    
    errorCode = PAC194x5x_GetVSENSEn_AVG_real(pdevice, channelNo, &VsenseAvgReal);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pvalue = (VsenseAvgReal * 1000000 ) / pdevice->rsense[channelNo-1];     //mA
    
    return errorCode;
}


uint16_t PAC194x5x_GetVPOWERn_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint32_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_VPOWERN_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer = 0;
    uint8_t byteCount = 0;
    uint16_t errorCode = 0;

    if (channelNo > (pdevice->HwChannels)){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;
    }
    memset(&readBuffer,0,sizeof(readBuffer));
    
    byteCount = PAC194X5X_VPOWERN_SZ;
    
    switch(channelNo){
        case 1:
            registerPointer = PAC194X5X_VPOWER1_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_VPOWER2_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_VPOWER3_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_VPOWER4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    vTaskDelay(10/ portTICK_RATE_MS);
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pregister_val = readBuffer[0];
    *pregister_val = (*pregister_val << 8) + readBuffer[1];
    *pregister_val = (*pregister_val << 8) + readBuffer[2];
    *pregister_val = (*pregister_val << 8) + readBuffer[3];
    // VINEETH - TODO Check data sheet page no - 50 //
    // LSB 2 bits are unimplemented, but read as 0s.
    // Do we need to avoid those 2 bits ??
    //*pregister_val = *pregister_val >> 2; //VINEETH , NEED TO VERIFY
//    ESP_LOGI("VPower","CH[%d] VPower: %d",channelNo,  (int32_t)*pregister_val);    
    return errorCode;
}


uint16_t PAC194x5x_GetVPOWERn_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint32_t* VpowerReg){
    uint16_t errorCode;
    
    errorCode = PAC194x5x_GetVPOWERn_reg(pdevice, channelNo, VpowerReg);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    errorCode = PAC194x5x_UpdateContext_ChannelPolarity(pdevice, channelNo);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    return errorCode;
}


uint16_t PAC194x5x_GetSMBusSettings_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PPAC194X5X_SMBUS_SETTINGS_REGISTER pSMBus_reg){
    uint8_t readBuffer[PAC194X5X_SMBUS_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_SMBUS_SZ;
    registerPointer = PAC194X5X_SMBUS_SETTINGS_ADDR;
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    memcpy(pSMBus_reg, readBuffer, sizeof(PAC194X5X_SMBUS_SETTINGS_REGISTER));
    
    // cache the BYTE_COUNT flag into device context
    pdevice->ENABLE_BYTE_COUNT_FLAG = (pSMBus_reg->BYTE_COUNT == 1) ? true: false;

    return errorCode;
}


uint16_t PAC194x5x_SetSMBusSettings_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PAC194X5X_SMBUS_SETTINGS_REGISTER SMBus_reg){
    uint8_t writeBuffer[PAC194X5X_SMBUS_SZ + 1];
    void *pwriteBuffer;
    uint16_t errorCode;
    
    pwriteBuffer = &SMBus_reg;
    writeBuffer[0] = PAC194X5X_SMBUS_SETTINGS_ADDR;
    writeBuffer[1] = *(uint8_t*)pwriteBuffer;
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    // cache the BYTE_COUNT flag into device context
    pdevice->ENABLE_BYTE_COUNT_FLAG = (SMBus_reg.BYTE_COUNT == 1) ? true: false;
    
    return errorCode;
}


uint16_t PAC194x5x_GetNegPwrFsr_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t reg_select, PPAC194X5X_NEG_PWR_FSR_REGISTER pNegPwrFsr_reg){
    uint8_t readBuffer[PAC194X5X_NEGPWRFSR_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_NEGPWRFSR_SZ;
    switch(reg_select){
        case 1:
            registerPointer = PAC194X5X_NEG_PWR_FSR_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_NEG_PWR_FSR_ACT_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_NEG_PWR_FSR_LAT_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
