NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;

    // We can let pNegPwrFsr_reg == NULL if we only need the context NEG_PWR_FSR_LAT update
    if (pNegPwrFsr_reg != NULL){    
        memcpy(pNegPwrFsr_reg, readBuffer, sizeof(PAC194X5X_NEG_PWR_FSR_REGISTER));
    }
    
    // cache the NEG_PWR_FSR_LAT value in the device context
    if (reg_select == 3){
        int i;
        memcpy(&pdevice->negPwrFsr_LAT, readBuffer, sizeof(PAC194X5X_NEG_PWR_FSR_REGISTER));
        pdevice->negPwrFsr_LAT_cached = true;
        //invalidate the cached polarity info
        for (i = 0; i < pdevice->HwChannels; i++){
           pdevice->ScaleValues_cached[i] = false;
        }
    }
    
    return errorCode;
}


uint16_t PAC194x5x_SetNegPwrFsr_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PAC194X5X_NEG_PWR_FSR_REGISTER NegPwrFsr_reg){
    uint8_t writeBuffer[PAC194X5X_NEGPWRFSR_SZ + 1];
    void *pwriteBuffer;
    uint16_t errorCode;
    
    pwriteBuffer = &NegPwrFsr_reg;
    writeBuffer[0] = PAC194X5X_NEG_PWR_FSR_ADDR;
    memcpy(writeBuffer+1, (uint8_t*)pwriteBuffer, sizeof(PAC194X5X_NEG_PWR_FSR_REGISTER));
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    // invalidate the cached NEG_PWR_FSR_LAT value in the device context
    pdevice->negPwrFsr_LAT_cached = false;
    
    return errorCode;
}


uint16_t PAC194x5x_GetSlow_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PPAC194X5X_SLOW_REGISTER pSlow_reg){
    uint8_t readBuffer[PAC194X5X_SLOW_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_SLOW_SZ;
    registerPointer = PAC194X5X_SLOW_ADDR;
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    memcpy(pSlow_reg, readBuffer, sizeof(PAC194X5X_SLOW_REGISTER));
    
    return errorCode;
}


uint16_t PAC194x5x_SetSlow_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PAC194X5X_SLOW_REGISTER Slow_reg){
    uint8_t writeBuffer[PAC194X5X_SLOW_SZ + 1];
    void *pwriteBuffer;
    uint16_t errorCode;
    
    pwriteBuffer = &Slow_reg;
    writeBuffer[0] = PAC194X5X_SLOW_ADDR;
    writeBuffer[1] = *(uint8_t*)pwriteBuffer;
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));

    return errorCode;
}


uint16_t PAC194x5x_GetAccumConfig_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t reg_select, PPAC194X5X_ACCUM_CONFIG_REGISTER pAccumConfig_reg){
    uint8_t readBuffer[PAC194X5X_ACCUMCONFIG_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_ACCUMCONFIG_SZ;
    switch(reg_select){
        case 1:
            registerPointer = PAC194X5X_ACCUM_CONFIG_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_ACCUM_CONFIG_ACT_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_ACCUM_CONFIG_LAT_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;

    // We can let pAccumConfig_reg == NULL if we only need the context ACCUM_CONFIG_LAT update
    if (pAccumConfig_reg != NULL){    
        memcpy(pAccumConfig_reg, readBuffer, sizeof(PAC194X5X_ACCUM_CONFIG_REGISTER));
    }
    
    // cache the ACCUM_CONFIG_LAT value in the device context
    if (reg_select == 3){
        memcpy(&pdevice->accumConfig_LAT, readBuffer, sizeof(PAC194X5X_ACCUM_CONFIG_REGISTER));
        pdevice->accumConfig_LAT_cached = true;
    }
    
    return errorCode;    
}


uint16_t PAC194x5x_SetAccumConfig_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PAC194X5X_ACCUM_CONFIG_REGISTER AccumConfig_reg){
    uint8_t writeBuffer[PAC194X5X_ACCUMCONFIG_SZ + 1];
    void *pwriteBuffer;
    uint16_t errorCode;
    
    pwriteBuffer = &AccumConfig_reg;
    writeBuffer[0] = PAC194X5X_ACCUM_CONFIG_ADDR;
    writeBuffer[1] = *(uint8_t*)pwriteBuffer;
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    // invalidate the cached accumConfig_LAT value in the device context
    pdevice->accumConfig_LAT_cached = false;
    
    return errorCode;
}


uint16_t PAC194x5x_GetAlertStatus_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PPAC194X5X_ALERT_STATUS_REGISTER pAlertStatus_reg){
    uint8_t readBuffer[PAC194X5X_ALERT_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_ALERT_SZ;
    registerPointer = PAC194X5X_ALERT_STATUS_ADDR;
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    memcpy((void *)pAlertStatus_reg, readBuffer, sizeof(PAC194X5X_ALERT_STATUS_REGISTER));
 
    return errorCode;
}


uint16_t PAC194x5x_GetAlertEnable_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PPAC194X5X_ALERT_REGISTER pAlertEnable_reg){
    uint8_t readBuffer[PAC194X5X_ALERT_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_ALERT_SZ;
    registerPointer = PAC194X5X_ALERT_ENABLE_ADDR;
    
