NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    ESP_LOGI("GET_AL","[0]:0x%X [1]=0x%X [2]=0x%X", readBuffer[0],readBuffer[1],readBuffer[2]);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    memcpy(pAlertEnable_reg, readBuffer, sizeof(PAC194X5X_ALERT_REGISTER));
    
    return errorCode;
}


uint16_t PAC194x5x_SetAlertEnable_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PAC194X5X_ALERT_REGISTER AlertEnable_reg){
    uint8_t writeBuffer[PAC194X5X_ALERT_SZ + 1];
    void *pwriteBuffer;
    uint16_t errorCode;
    
    pwriteBuffer = &AlertEnable_reg;
    writeBuffer[0] = PAC194X5X_ALERT_ENABLE_ADDR;
    memcpy(writeBuffer+1, (uint8_t*)pwriteBuffer, sizeof(PAC194X5X_ALERT_REGISTER));
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    
    return errorCode;
}


uint16_t PAC194x5x_GetSlowAlert1_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PPAC194X5X_ALERT_REGISTER pSlowAlert1_reg){
    uint8_t readBuffer[PAC194X5X_ALERT_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_ALERT_SZ;
    registerPointer = PAC194X5X_SLOW_ALERT1_ADDR;
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    memcpy(pSlowAlert1_reg, readBuffer, sizeof(PAC194X5X_ALERT_REGISTER));
    
    return errorCode;
}


uint16_t PAC194x5x_SetSlowAlert1_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PAC194X5X_ALERT_REGISTER SlowAlert1_reg){
    uint8_t writeBuffer[PAC194X5X_ALERT_SZ + 1];
    void *pwriteBuffer;
    uint16_t errorCode;
    
    pwriteBuffer = &SlowAlert1_reg;
    writeBuffer[0] = PAC194X5X_SLOW_ALERT1_ADDR;
    memcpy(writeBuffer+1, (uint8_t*)pwriteBuffer, sizeof(PAC194X5X_ALERT_REGISTER));
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    
    return errorCode;
}


uint16_t PAC194x5x_GetGpioAlert2_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PPAC194X5X_ALERT_REGISTER pGpioAlert2_reg){
    uint8_t readBuffer[PAC194X5X_ALERT_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_ALERT_SZ;
    registerPointer = PAC194X5X_GPIO_ALERT2_ADDR;
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    memcpy(pGpioAlert2_reg, readBuffer, sizeof(PAC194X5X_ALERT_REGISTER));
    
    return errorCode;
}


uint16_t PAC194x5x_SetGpioAlert2_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PAC194X5X_ALERT_REGISTER GpioAlert2_reg){
    uint8_t writeBuffer[PAC194X5X_ALERT_SZ + 1];
    void *pwriteBuffer;
    uint16_t errorCode;
    
    pwriteBuffer = &GpioAlert2_reg;
    writeBuffer[0] = PAC194X5X_GPIO_ALERT2_ADDR;
    memcpy(writeBuffer+1, (uint8_t*)pwriteBuffer, sizeof(PAC194X5X_ALERT_REGISTER));
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    
    return errorCode;
}


uint16_t PAC194x5x_GetAccFullness_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PPAC194X5X_ACCUM_LIMITS_REGISTER pAccFullnessLimits_reg){
    uint8_t readBuffer[PAC194X5X_OTHERLIMIT_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_OTHERLIMIT_SZ;
    registerPointer = PAC194X5X_ACC_FULLNESS_LIMITS_ADDR;
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    memcpy(pAccFullnessLimits_reg, readBuffer, sizeof(PAC194X5X_ACCUM_LIMITS_REGISTER));
    
    return errorCode;
}


uint16_t PAC194x5x_SetAccFullness_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, PAC194X5X_ACCUM_LIMITS_REGISTER AccFullnessLimits_reg){
    uint8_t writeBuffer[PAC194X5X_OTHERLIMIT_SZ + 1];
    void *pwriteBuffer;
    uint16_t errorCode;
    
    pwriteBuffer = &AccFullnessLimits_reg;
    writeBuffer[0] = PAC194X5X_ACC_FULLNESS_LIMITS_ADDR;
    memcpy(writeBuffer+1, (uint8_t*)pwriteBuffer, sizeof(PAC194X5X_ACCUM_LIMITS_REGISTER));
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    
    return errorCode;
}


uint16_t PAC194x5x_GetOClimit_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint16_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_OTHERLIMIT_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_OTHERLIMIT_SZ;
    
    switch(channelNo){
        case 1:
            registerPointer = PAC194X5X_OC_LIMIT1_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_OC_LIMIT2_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_OC_LIMIT3_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_OC_LIMIT4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pregister_val = readBuffer[0];
    *pregister_val = (*pregister_val << 8) + readBuffer[1];
    
    return errorCode;
}


