NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
uint16_t PAC194x5x_GetOClimit_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    uint16_t errorCode = PAC194X5X_SUCCESS;
    uint16_t limitRegister;
    int16_t signedReg;
    int32_t tempProd;
    float limitReal;

    // validate channelNo parameter
    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;       
    }
    
    if(pdevice->rsense[channelNo-1] == 0){
        *pvalue = 0.0;
        return PAC194X5X_NO_SHUNT;
    }
    
    errorCode = PAC194x5x_GetOClimit_reg(pdevice, channelNo, &limitRegister);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    signedReg = (int16_t)limitRegister; // limit register is always signed
    tempProd = (int32_t)signedReg * (int32_t)pdevice->VsenseFSR;
    limitReal = (float)tempProd * 1000000.0;
    limitReal /= pdevice->rsense[channelNo-1];     //mA
    *pvalue = limitReal / 32768.0;
    
    return errorCode;
}


uint16_t PAC194x5x_SetOClimit_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint16_t register_val){
    uint8_t writeBuffer[PAC194X5X_OTHERLIMIT_SZ + 1];
    uint16_t errorCode;
    
    switch(channelNo){
        case 1:
            writeBuffer[0] = PAC194X5X_OC_LIMIT1_ADDR;
            break;
        case 2:
            writeBuffer[0] = PAC194X5X_OC_LIMIT2_ADDR;
            break;
        case 3:
            writeBuffer[0] = PAC194X5X_OC_LIMIT3_ADDR;
            break;
        case 4:
            writeBuffer[0] = PAC194X5X_OC_LIMIT4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    writeBuffer[1] = (register_val >> 8) & 0xff;
    writeBuffer[2] = register_val & 0xff;
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    
    return errorCode;
}


uint16_t PAC194x5x_SetOClimit_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float value){
    uint16_t errorCode = PAC194X5X_SUCCESS;
    uint16_t limitRegister;
    float maxLimit;
    float flimit;
    int16_t ilimit;
    
    // validate channelNo parameter
    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;       
    }
    
    if(pdevice->rsense[channelNo-1] == 0){
        return PAC194X5X_NO_SHUNT;
    }
    
    //compute the device maximum supported current limit = VsenseFSR / Rsense
    maxLimit = (float)pdevice->VsenseFSR * 1000000;
    maxLimit /= (float)pdevice->rsense[channelNo-1];

    if(value >= maxLimit){
        //if the requested limit value is above the device +FSR,
        //set the limit register to the max positive value
        limitRegister = 0x7fff; //32767
    }else if(value < (-maxLimit)){
        //if the requested limit value is below the device -FSR,
        //set the limit register to the min negative value        
        limitRegister = 0x8000; //-32768
    }else{
        //compute the limit register = value * 2^15 * Rsense / VsenseFSR  
        flimit = value * 32768.0 / maxLimit;
        ilimit = (int16_t)flimit;
        limitRegister = (uint16_t)ilimit;
    }
    
    errorCode = PAC194x5x_SetOClimit_reg(pdevice, channelNo, limitRegister);
    
    return errorCode;
}


uint16_t PAC194x5x_GetUClimit_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint16_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_OTHERLIMIT_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_OTHERLIMIT_SZ;
    
    switch(channelNo){
        case 1:
            registerPointer = PAC194X5X_UC_LIMIT1_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_UC_LIMIT2_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_UC_LIMIT3_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_UC_LIMIT4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pregister_val = readBuffer[0];
    *pregister_val = (*pregister_val << 8) + readBuffer[1];
    
    return errorCode;
}

uint16_t PAC194x5x_GetUClimit_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    uint16_t errorCode = PAC194X5X_SUCCESS;
    uint16_t limitRegister;
    int16_t signedReg;
    int32_t tempProd;
    float limitReal;
    
    // validate channelNo parameter
    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;       
    }
    
    if(pdevice->rsense[channelNo-1] == 0){
        *pvalue = 0.0;
        return PAC194X5X_NO_SHUNT;
    }
    
    errorCode = PAC194x5x_GetUClimit_reg(pdevice, channelNo, &limitRegister);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    signedReg = (int16_t)limitRegister; // limit register is always signed
    tempProd = (int32_t)signedReg * (int32_t)pdevice->VsenseFSR;
    limitReal = (float)tempProd * 1000000.0;
    limitReal /= pdevice->rsense[channelNo-1];     //mA
    *pvalue = limitReal / 32768.0;
    
    return errorCode;
}


uint16_t PAC194x5x_SetUClimit_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint16_t register_val){
    uint8_t writeBuffer[PAC194X5X_OTHERLIMIT_SZ + 1];
    uint16_t errorCode;
    
    switch(channelNo){
        case 1:
            writeBuffer[0] = PAC194X5X_UC_LIMIT1_ADDR;
            break;
        case 2:
            writeBuffer[0] = PAC194X5X_UC_LIMIT2_ADDR;
            break;
        case 3:
            writeBuffer[0] = PAC194X5X_UC_LIMIT3_ADDR;
            break;
        case 4:
            writeBuffer[0] = PAC194X5X_UC_LIMIT4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    writeBuffer[1] = (register_val >> 8) & 0xff;
    writeBuffer[2] = register_val & 0xff;
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    
    return errorCode;
}


uint16_t PAC194x5x_SetUClimit_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float value){
    uint16_t errorCode = PAC194X5X_SUCCESS;
    uint16_t limitRegister;
    float maxLimit;
    float flimit;
    int16_t ilimit;
    
    // validate channelNo parameter
    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;       
    }
    
