NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
    if(pdevice->rsense[channelNo-1] == 0){
        return PAC194X5X_NO_SHUNT;
    }
    
    //compute the device maximum supported current limit = VsenseFSR / Rsense
    maxLimit = (float)pdevice->VsenseFSR * 1000000;
    maxLimit /= (float)pdevice->rsense[channelNo-1];

    if(value >= maxLimit){
        //if the requested limit value is above the device +FSR,
        //set the limit register to the max positive value
        limitRegister = 0x7fff; //32767
    }else if(value < (-maxLimit)){
        //if the requested limit value is below the device -FSR,
        //set the limit register to the min negative value        
        limitRegister = 0x8000; //-32768
    }else{
        //compute the limit register = value * 2^15 * Rsense / VsenseFSR  
        flimit = value * 32768.0 / maxLimit;
        ilimit = (int16_t)flimit;
        limitRegister = (uint16_t)ilimit;
    }
    
    errorCode = PAC194x5x_SetUClimit_reg(pdevice, channelNo, limitRegister);
    
    return errorCode;
}


uint16_t PAC194x5x_GetOPlimit_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint32_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_OPLIMIT_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_OPLIMIT_SZ;
    
    switch(channelNo){
        case 1:
            registerPointer = PAC194X5X_OP_LIMIT1_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_OP_LIMIT2_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_OP_LIMIT3_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_OP_LIMIT4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    *pregister_val = readBuffer[0];
    *pregister_val = (*pregister_val << 8) + readBuffer[1];
    *pregister_val = (*pregister_val << 8) + readBuffer[2];
    
    return errorCode;
}


uint16_t PAC194x5x_GetOPlimit_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    uint16_t errorCode = PAC194X5X_SUCCESS;
    uint32_t limitRegister;
    int32_t signedReg;
    float PowerUnit;
    
    // validate channelNo parameter
    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;       
    }
    
    if(pdevice->rsense[channelNo-1] == 0){
        *pvalue = 0.0;
        return PAC194X5X_NO_SHUNT;
    }
    
    errorCode = PAC194x5x_GetOPlimit_reg(pdevice, channelNo, &limitRegister);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    //sign extend the 24-bit OP limit register
    if ((limitRegister >> 23) & 0x1) {
        limitRegister = limitRegister | ~0xFFFFFFLL;    //sign extension
    }    
    signedReg = (int32_t)limitRegister; // limit register is always signed

    PowerUnit = (float)pdevice->VPowerFSR * 1000000 / pdevice->rsense[channelNo-1];
    PowerUnit /= 8388608.0;   // milli-Watts/bit  

    *pvalue = (float)signedReg * PowerUnit;
    if(pdevice->LowSide == 1) *pvalue *= pdevice->VrailToVbusRatio[channelNo-1];
    
    return errorCode;
}


uint16_t PAC194x5x_SetOPlimit_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint32_t register_val){
    uint8_t writeBuffer[PAC194X5X_OPLIMIT_SZ + 1];
    uint16_t errorCode;
    
    switch(channelNo){
        case 1:
            writeBuffer[0] = PAC194X5X_OP_LIMIT1_ADDR;
            break;
        case 2:
            writeBuffer[0] = PAC194X5X_OP_LIMIT2_ADDR;
            break;
        case 3:
            writeBuffer[0] = PAC194X5X_OP_LIMIT3_ADDR;
            break;
        case 4:
            writeBuffer[0] = PAC194X5X_OP_LIMIT4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    writeBuffer[1] = (register_val >> 16) & 0xff;
    writeBuffer[2] = (register_val >> 8) & 0xff;
    writeBuffer[3] = register_val & 0xff;
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    
    return errorCode;
}


uint16_t PAC194x5x_SetOPlimit_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float value){
    uint16_t errorCode = PAC194X5X_SUCCESS;
    uint32_t limitRegister;
    float maxLimit;
    float flimit;
    int32_t ilimit;
    
    // validate channelNo parameter
    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;       
    }
    
    if(pdevice->rsense[channelNo-1] == 0){
        return PAC194X5X_NO_SHUNT;
    }
    
    //compute the device maximum supported power limit = VPowerFSR * VrailToVbusRatio / Rsense
    maxLimit = (float)pdevice->VPowerFSR * 1000000;
    if(pdevice->LowSide == 1) maxLimit *= pdevice->VrailToVbusRatio[channelNo-1];
    maxLimit /= (float)pdevice->rsense[channelNo-1];

    if(value >= maxLimit){
        //if the requested limit value is above the device +FSR,
        //set the limit register to the max positive value
        limitRegister = 0x7fffff; //8388607
    }else if(value < (-maxLimit)){
        //if the requested limit value is below the device -FSR,
        //set the limit register to the min negative value        
        limitRegister = 0x800000; //-8388608
    }else{
        //compute the limit register = value * 2^23 * Rsense / (VsenseFSR * VrailToVbusRatio)  
        flimit = value * 8388608.0 / maxLimit;
        ilimit = (int32_t)flimit;
        limitRegister = (uint32_t)ilimit;
    }
    
    errorCode = PAC194x5x_SetOPlimit_reg(pdevice, channelNo, limitRegister);
    
    return errorCode;
}


uint16_t PAC194x5x_GetOVlimit_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint16_t* pregister_val){
    uint8_t readBuffer[PAC194X5X_OTHERLIMIT_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_OTHERLIMIT_SZ;
    
