NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
    signedReg = (int16_t)limitRegister; // limit register is always signed
    tempProd = (int32_t)signedReg * (int32_t)pdevice->VbusFSR;
    *pvalue = (float)tempProd / 32768.0;    //mV
    if(pdevice->LowSide == 1) *pvalue *= pdevice->VrailToVbusRatio[channelNo-1]; 
    
    return errorCode;
}


uint16_t PAC194x5x_SetUVlimit_reg(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, uint16_t register_val){
    uint8_t writeBuffer[PAC194X5X_OTHERLIMIT_SZ + 1];
    uint16_t errorCode;
    
    switch(channelNo){
        case 1:
            writeBuffer[0] = PAC194X5X_UV_LIMIT1_ADDR;
            break;
        case 2:
            writeBuffer[0] = PAC194X5X_UV_LIMIT2_ADDR;
            break;
        case 3:
            writeBuffer[0] = PAC194X5X_UV_LIMIT3_ADDR;
            break;
        case 4:
            writeBuffer[0] = PAC194X5X_UV_LIMIT4_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    writeBuffer[1] = (register_val >> 8) & 0xff;
    writeBuffer[2] = register_val & 0xff;
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    
    return errorCode;
}


uint16_t PAC194x5x_SetUVlimit_real(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float value){
    uint16_t errorCode = PAC194X5X_SUCCESS;
    uint16_t limitRegister;
    float maxLimit;
    float flimit;
    int16_t ilimit;
    
    // validate channelNo parameter
    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;       
    }
    
    //compute the maximum supported voltage limit = VbusFSR * VrailToVbusRatio
    maxLimit = (float)pdevice->VbusFSR;
    if(pdevice->LowSide == 1) maxLimit *= pdevice->VrailToVbusRatio[channelNo-1];
    
    if(value >= maxLimit){
        //if the requested limit value is above the device +FSR,
        //set the limit register to the max positive value
        limitRegister = 0x7fff; //32767
    }else if(value < (-maxLimit)){
        //if the requested limit value is below the device -FSR,
        //set the limit register to the min negative value        
        limitRegister = 0x8000; //-32768
    }else{
        //compute the limit register = value * 2^15 / (VbusFSR * VrailToVbusRatio)   
        flimit = value * 32768.0 / maxLimit;
        ilimit = (int16_t)flimit;
        limitRegister = (uint16_t)ilimit;
    }
    
    errorCode = PAC194x5x_SetUVlimit_reg(pdevice, channelNo, limitRegister);
    
    return errorCode;
}


uint16_t PAC194x5x_GetLimitNsamples(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t reg_select, PPAC194X5X_LIMIT_NSAMPLES_REGISTER pLimitNsamples_reg){
    uint8_t readBuffer[PAC194X5X_OTHERLIMIT_N_SZ + SMBUS_BYTECNT];
    uint8_t registerPointer;
    uint8_t byteCount;
    uint16_t errorCode;
    
    byteCount = PAC194X5X_OTHERLIMIT_N_SZ;
    switch(reg_select){
        case 1:
            registerPointer = PAC194X5X_OC_LIMIT_N_ADDR;
            break;
        case 2:
            registerPointer = PAC194X5X_UC_LIMIT_N_ADDR;
            break;
        case 3:
            registerPointer = PAC194X5X_OP_LIMIT_N_ADDR;
            break;
        case 4:
            registerPointer = PAC194X5X_OV_LIMIT_N_ADDR;
            break;
        case 5:
            registerPointer = PAC194X5X_UV_LIMIT_N_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    errorCode = PAC194x5x_Write(pdevice, &registerPointer, sizeof(registerPointer));
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    //read the register
    errorCode = PAC194x5x_Read(pdevice, readBuffer, &byteCount);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
    memcpy(pLimitNsamples_reg, readBuffer, sizeof(PAC194X5X_LIMIT_NSAMPLES_REGISTER));
    
    return errorCode;
}


uint16_t PAC194x5x_SetLimitNsamples(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t reg_select, PAC194X5X_LIMIT_NSAMPLES_REGISTER LimitNsamples_reg){
    uint8_t writeBuffer[PAC194X5X_OTHERLIMIT_N_SZ + 1];
    void *pwriteBuffer;
    uint16_t errorCode;
    
    pwriteBuffer = &LimitNsamples_reg;
    
    switch(reg_select){
        case 1:
            writeBuffer[0] = PAC194X5X_OC_LIMIT_N_ADDR;
            break;
        case 2:
            writeBuffer[0] = PAC194X5X_UC_LIMIT_N_ADDR;
            break;
        case 3:
            writeBuffer[0] = PAC194X5X_OP_LIMIT_N_ADDR;
            break;
        case 4:
            writeBuffer[0] = PAC194X5X_OV_LIMIT_N_ADDR;
            break;
        case 5:
            writeBuffer[0] = PAC194X5X_UV_LIMIT_N_ADDR;
            break;
        default:
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;      
    }
    
    writeBuffer[1] = *(uint8_t*)pwriteBuffer;
    
    errorCode = PAC194x5x_Write(pdevice, writeBuffer, sizeof(writeBuffer));
    
    return errorCode;
}


uint16_t PAC194x5x_VBUS_LSBunit(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    uint16_t errorCode = PAC194X5X_SUCCESS;

//    channelNo parameter already validated by PAC194x5x_GetChannelPolarityInfo()
//    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
//        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
//        return errorCode;
//    }
    
    errorCode = PAC194x5x_UpdateContext_ChannelPolarity(pdevice, channelNo);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
        
    *pvalue = (float)pdevice->VbusScale[channelNo - 1] / 65536.0;    //mV per bit
    if(pdevice->LowSide == 1) *pvalue *= pdevice->VrailToVbusRatio[channelNo-1];  
    
    return errorCode;
}


uint16_t PAC194x5x_VSENSE_LSBunit(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    uint16_t errorCode = PAC194X5X_SUCCESS;

//    channelNo parameter already validated by PAC194x5x_GetChannelPolarityInfo()
//    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
//        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
//        return errorCode;
//    }
    
    errorCode = PAC194x5x_UpdateContext_ChannelPolarity(pdevice, channelNo);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
        
    *pvalue = (float)pdevice->VsenseScale[channelNo - 1] / 65536.0;    //mV per bit
    
    return errorCode;
}


uint16_t PAC194x5x_VPOWER_LSBunit(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo, float* pvalue){
    uint16_t errorCode = PAC194X5X_SUCCESS;

//    channelNo parameter already validated by PAC194x5x_GetChannelPolarityInfo()
//    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
//        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
//        return errorCode;
//    }
    
    errorCode = PAC194x5x_UpdateContext_ChannelPolarity(pdevice, channelNo);
    if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    
