NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
    //compute VPowerScale / Rsense)
    //VPowerScale expressed in milli-V^2
    //rsense expressed in micro-Ohm
    //result expressed in milli-Watt
    *pvalue = (float)(pdevice->VPowerScale[channelNo - 1]) * 1000000.0 / (float)(pdevice->rsense[channelNo - 1]);
    *pvalue /= 1073741824.0;    //mWatt per bit
    
    if(pdevice->LowSide == 1) *pvalue *= pdevice->VrailToVbusRatio[channelNo-1];  
    
    return errorCode;
}


uint16_t PAC194x5x_UpdateContext_ChannelPolarity(PPAC194X5X_DEVICE_CONTEXT pdevice, uint8_t channelNo){
    uint16_t VpowerFSR;
    uint16_t VbusFSR;
    uint16_t VsenseFSR;
    uint8_t isSignedPower = 0;
    uint8_t isSignedVbus = 0;
    uint8_t isSignedVsense = 0;
    uint8_t cfgVSense = 0;
    uint8_t cfgVBus = 0;
    uint16_t errorCode;

    // validate channelNo parameter
    if ( (channelNo == 0) || (channelNo > pdevice->HwChannels) ){
        errorCode = PAC194X5X_INVALID_INPUT_VALUE;
        return errorCode;       
    }
    
    // init power factor FSR
    VpowerFSR = pdevice->VPowerFSR;
    // init voltage FSR
    VbusFSR = pdevice->VbusFSR;
    VsenseFSR = pdevice->VsenseFSR;

    // Check if the cached negPwrFsr_LAT is valid
    if(pdevice->negPwrFsr_LAT_cached == false){
        //PAC194x5x_GetNegPwrFsr_reg() updates the cached negPwrFsr_LAT
        //and invalidates the cached channel polarity info
        errorCode = PAC194x5x_GetNegPwrFsr_reg(pdevice, 3, NULL); 
        if(errorCode != PAC194X5X_SUCCESS) return errorCode;
    }
    
    // Check if the cached channel polarity info is valid
    // If the ScaleValues_cached[channelNo-1] is still valid
    // skip performing again the Scale computations
    errorCode = PAC194X5X_SUCCESS;
    if (pdevice->ScaleValues_cached[channelNo-1] == true) return errorCode;
    
    //
    // Check the cached NEG_PWR register.
    // - If either VSense or VBus is bipolar, the chanel is bipolar
    // - If either VSense or VBus is FSR/2, the channel is "FSR/2 mode" and bipolar
    //
    switch (channelNo){
        case 1:{
            cfgVSense = pdevice->negPwrFsr_LAT.CFG_VS1;     // NegPwrFsr.CFG_VS1;
            cfgVBus = pdevice->negPwrFsr_LAT.CFG_VB1;       // NegPwrFsr.CFG_VB1;
            break;
        }

        case 2:{
            cfgVSense = pdevice->negPwrFsr_LAT.CFG_VS2;     // NegPwrFsr.CFG_VS2;
            cfgVBus = pdevice->negPwrFsr_LAT.CFG_VB2;       //  NegPwrFsr.CFG_VB2;
            break;
        }

        case 3:{
            cfgVSense = pdevice->negPwrFsr_LAT.CFG_VS3;     // NegPwrFsr.CFG_VS3;
            cfgVBus = pdevice->negPwrFsr_LAT.CFG_VB3;       // NegPwrFsr.CFG_VB3;
            break;
        }

        case 4:{
            cfgVSense = pdevice->negPwrFsr_LAT.CFG_VS4;     // NegPwrFsr.CFG_VS4;
            cfgVBus = pdevice->negPwrFsr_LAT.CFG_VB4;       // NegPwrFsr.CFG_VB4;
            break;
        }

        default:{
            errorCode = PAC194X5X_INVALID_INPUT_VALUE;
            return errorCode;   
        }
    }

    if (cfgVSense == 0x1) {
        VsenseFSR *= 2; // LSB value is double for bipolar channels

    }

    if (cfgVBus == 0x1) {
        VbusFSR *= 2; // LSB value is double for bipolar channels
    }

    if ((cfgVSense | cfgVBus) == 0x1) {
        VpowerFSR *= 2; // LSB value is double for "bipolar mode" channels
                        // either Vbus or Vsense are bipolar and no one is FSR/2
    }

    if ( cfgVSense  != 0x0) {
        isSignedPower  = 1;     // either Vbus or Vsense are bipolar or FSR/2
        isSignedVsense = 1;     // Vsense is bipolar
    }
 
    if ( cfgVBus != 0x0) {
        isSignedPower = 1;      // either Vbus or Vsense are bipolar or FSR/2
        isSignedVbus  = 1;      // Vbus is bipolar
    }    

    (pdevice->VbusScale[channelNo - 1]) = VbusFSR;
    (pdevice->VsenseScale[channelNo - 1]) = VsenseFSR;
    (pdevice->VPowerScale[channelNo - 1]) = VpowerFSR;
    (pdevice->IsSignedPower[channelNo - 1]) = isSignedPower;
    (pdevice->IsSignedVsense[channelNo - 1]) = isSignedVsense;
    (pdevice->IsSignedVbus[channelNo - 1]) = isSignedVbus;

    // ScaleValues_cached[channelNo-1] is now valid
    // set the "cached" flag to true
    pdevice->ScaleValues_cached[channelNo-1] = true;
            
    return errorCode;
}


uint16_t PAC194x5x_UpdateContext_Ctrl(PPAC194X5X_DEVICE_CONTEXT pdevice){
    uint16_t errorCode = PAC194X5X_SUCCESS;

    //check if cached CTRL_LAT is valid
    //if NOT valid, update the cache
    if(pdevice->ctrl_LAT_cached == false){
        errorCode = PAC194x5x_GetCtrl_reg(pdevice, 3, NULL);
    }    
    return errorCode;
}


uint16_t PAC194x5x_UpdateContext_AccumConfig(PPAC194X5X_DEVICE_CONTEXT pdevice){
    uint16_t errorCode = PAC194X5X_SUCCESS;

    //check if cached ACCUM_CONFIG_LAT is valid
    //if NOT valid, update the cache
    if(pdevice->accumConfig_LAT_cached == false){
        errorCode = PAC194x5x_GetAccumConfig_reg(pdevice, 3, NULL);
    }     
    return errorCode;
}

uint16_t PAC194x5x_GetVIP_Analog(PPAC194X5X_DEVICE_CONTEXT pdevice,float *pValue){

    uint16_t errorCode;
    float Isense_ch1,VBus_ch1;
    float Isense_ch2,VBus_ch2;
    uint32_t Vpower_ch1, Vpower_ch2;

    errorCode = PAC194x5x_RefreshV(pdevice);
    vTaskDelay(1/ portTICK_RATE_MS);

    errorCode = PAC194x5x_GetVBUSn_AVG_real(pdevice, 1, &VBus_ch1);
    errorCode = PAC194x5x_GetISENSEn_AVG_real(pdevice,1, &Isense_ch1);
    errorCode = PAC194x5x_GetVPOWERn_real(pdevice, 1, &Vpower_ch1);

    errorCode = PAC194x5x_GetVBUSn_AVG_real(pdevice, 2, &VBus_ch2);
    errorCode = PAC194x5x_GetISENSEn_AVG_real(pdevice,2, &Isense_ch2);
    errorCode = PAC194x5x_GetVPOWERn_real(pdevice, 2, &Vpower_ch2);
    
    pValue[0] = VBus_ch1;
    pValue[1] = Isense_ch1;
    pValue[2] = Vpower_ch1;
    pValue[3] = VBus_ch2;
    pValue[4] = Isense_ch2;
    pValue[5] = Vpower_ch2;

    return errorCode;
} 

uint16_t PAC194X5X_getBatteryVoltage(PPAC194X5X_DEVICE_CONTEXT pdevice,uint16_t *pValue){
    uint16_t errorCode;
    errorCode = PAC194x5x_RefreshV(pdevice);
    vTaskDelay(1/ portTICK_RATE_MS);
    errorCode = PAC194x5x_GetVBUSn_reg(pdevice, 1, pValue);
    return errorCode;
}

uint16_t PAC194x5x_GetVIP_digital(PPAC194X5X_DEVICE_CONTEXT pdevice,uint8_t *pValue, uint8_t byteSize){

    uint16_t errorCode = 0;

    uint16_t Vsense_ch1 = 0,VBus_ch1 = 0,Vsense_ch2 = 0,VBus_ch2 = 0;
    

    errorCode = PAC194x5x_RefreshV(pdevice);
    if(errorCode != ESP_OK) {
        return errorCode;
    }
    //vTaskDelay(100/ portTICK_RATE_MS);
    vTaskDelay(10/ portTICK_RATE_MS); //VIN - 1ms is required

    errorCode = PAC194x5x_GetVBUSn_AVG_reg(pdevice, 1, &VBus_ch1);
    if(errorCode != ESP_OK) {
        return errorCode;
    }
    vTaskDelay(10/ portTICK_RATE_MS);
    errorCode = PAC194x5x_GetVSENSEn_AVG_reg(pdevice, 1, &Vsense_ch1);
    if(errorCode != ESP_OK) {
        return errorCode;
    }

    vTaskDelay(10/ portTICK_RATE_MS);
    errorCode = PAC194x5x_GetVBUSn_AVG_reg(pdevice, 2, &VBus_ch2);
    if(errorCode != ESP_OK) {
        return errorCode;
    }
    
    vTaskDelay(10/ portTICK_RATE_MS);
    errorCode = PAC194x5x_GetVSENSEn_AVG_reg(pdevice, 2, &Vsense_ch2);
    if(errorCode != ESP_OK) {
        return errorCode;
    }

	pValue[0] = ((Vsense_ch1 >> 8) & 0xFF);
	pValue[1] = ( Vsense_ch1 & 0xFF);

	pValue[2] = ((Vsense_ch2 >> 8) & 0xFF);
	pValue[3] = ( Vsense_ch2 & 0xFF);
    
    pValue[4] = ((VBus_ch1 >> 8) & 0xFF);
	pValue[5] = ( VBus_ch1 & 0xFF);
    
    pValue[6] = ((VBus_ch2 >> 8) & 0xFF);
	pValue[7] = ( VBus_ch2 & 0xFF);

    if ( byteSize == 8 ){
        return errorCode;
    }

    vTaskDelay(10/ portTICK_RATE_MS);
    uint32_t Vpower_ch1 = 0,Vpower_ch2 = 0;
    errorCode = PAC194x5x_GetVPOWERn_reg(pdevice, 1, &Vpower_ch1);
    if(errorCode != ESP_OK) {
        return errorCode;
    }
    
    vTaskDelay(10/ portTICK_RATE_MS);
    errorCode = PAC194x5x_GetVPOWERn_reg(pdevice, 2, &Vpower_ch2);
    if(errorCode != ESP_OK) {
        return errorCode;
    }

