NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_pac1952.c
    int32_t Vpower_ch1_signed = ( (int32_t) Vpower_ch1 << 2 ) >> 2;
    int32_t Vpower_ch2_signed = ( (int32_t) Vpower_ch2 << 2 ) >> 2;

    pValue[8]  = ((Vpower_ch1_signed >> 24) & 0xFF);
    pValue[9]  = ((Vpower_ch1_signed >> 16) & 0xFF);
    pValue[10] = ((Vpower_ch1_signed >> 8) & 0xFF);
    pValue[11] = ((Vpower_ch1_signed) & 0xFF);
    
    pValue[12] = ((Vpower_ch2_signed >> 24) & 0xFF);
    pValue[13] = ((Vpower_ch2_signed >> 16) & 0xFF);
    pValue[14] = ((Vpower_ch2_signed >> 8) & 0xFF);
    pValue[15] = ((Vpower_ch2_signed) & 0xFF);

    return errorCode;
}

uint16_t PAC194x5x_SetOverVolt_limit(PPAC194X5X_DEVICE_CONTEXT pdevice,float value){

    value = value * 1000;
    ESP_LOGI(TAG,"Setting %f as overvoltage value",value);
    PAC194X5X_CTRL_REGISTER Ctrl_act,Ctrl_nw;
    PAC194X5X_ACCUM_LIMITS_REGISTER Accum;
    PAC194X5X_ALERT_REGISTER Alert_en_reg,GpioAlert2_reg;
    uint16_t errorCode;

   errorCode = PAC194x5x_GetCtrl_reg(pdevice, 1, &Ctrl_act);
    Ctrl_nw = Ctrl_act;
    Ctrl_nw.SAMPLE_MODE = 0b00;                                          //0x3 = 8sps adaptive accumulation
    Ctrl_nw.GPIO_ALERT2 = 0b00;
    Ctrl_nw.SAMPLE_MODE = 0b00;
    errorCode = PAC194x5x_SetCtrl_reg(pdevice,Ctrl_nw);                //write the CTRL register 

    errorCode = PAC194x5x_SetOVlimit_real(pdevice, 1, value);
    Accum.ACC_CH1 = 0b00;
    Accum.ACC_CH2 = 0b00;
    errorCode = PAC194x5x_SetAccFullness_reg(pdevice,Accum);

    Alert_en_reg.CH1_OV = 0x1;
    Alert_en_reg.CH2_OV = 0x0;
    errorCode = PAC194x5x_SetAlertEnable_reg(pdevice, Alert_en_reg);  //write the ALERT_ENABLE register 

    GpioAlert2_reg.CH1_OV = 0x1;
    GpioAlert2_reg.CH2_OV = 0x0;
    errorCode = PAC194x5x_SetGpioAlert2_reg(pdevice,GpioAlert2_reg);

    errorCode = PAC194x5x_Refresh(pdevice);
    vTaskDelay(1/ portTICK_RATE_MS);

    return errorCode;
}
